Public Attributes | List of all members
API_AnalyticalLink_Rotation Struct Reference
Analytical Model
Contains the Structural Analytical Model Analytical Link Rotation values. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalRigidityType  | kxxType
Rigidity type in X direction.
double  | kxxValue
Rigidity value in X direction.
API_AnalyticalRigidityType  | kyyType
Rigidity type in Y direction.
double  | kyyValue
Rigidity value in Y direction.
API_AnalyticalRigidityType  | kzzType
Rigidity type in Z direction.
double  | kzzValue
Rigidity value in Z direction.
bool  | resistanceMx
Resistance value along the X axis.
bool  | resistanceMy
Resistance value along the Y axis.
bool  | resistanceMz
Resistance value along the Z axis.
double  | mxValue
Rotation value in X direction.
double  | myValue
Rotation value in Y direction.
double  | mzValue
Rotation value in Z direction.
Detailed Description
Contains the Structural Analytical Model Analytical Link Rotation values.
Since
Archicad 25
Member Data Documentation
◆ kxxType
 API_AnalyticalLink_Rotation::kxxType
Rigidity type in X direction.
◆ kxxValue
 API_AnalyticalLink_Rotation::kxxValue
Rigidity value in X direction.
◆ kyyType
 API_AnalyticalLink_Rotation::kyyType
Rigidity type in Y direction.
◆ kyyValue
 API_AnalyticalLink_Rotation::kyyValue
Rigidity value in Y direction.
◆ kzzType
 API_AnalyticalLink_Rotation::kzzType
Rigidity type in Z direction.
◆ kzzValue
 API_AnalyticalLink_Rotation::kzzValue
Rigidity value in Z direction.
◆ mxValue
 API_AnalyticalLink_Rotation::mxValue
Rotation value in X direction.
◆ myValue
 API_AnalyticalLink_Rotation::myValue
Rotation value in Y direction.
◆ mzValue
 API_AnalyticalLink_Rotation::mzValue
Rotation value in Z direction.
◆ resistanceMx
 API_AnalyticalLink_Rotation::resistanceMx
Resistance value along the X axis.
◆ resistanceMy
 API_AnalyticalLink_Rotation::resistanceMy
Resistance value along the Y axis.
◆ resistanceMz
 API_AnalyticalLink_Rotation::resistanceMz
Resistance value along the Z axis.